{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "GPT2LMHeadModel",
    "parent_library": "transformers.models.gpt2.modeling_gpt2"
  },
  "base_model_name_or_path": "gpt2",
  "bias": "lora_only",
  "fan_in_fan_out": true,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": [
    "decode_head"
  ],
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "c_attn"
  ],
  "task_type": null
}